Revit 2024 API
StructuralConnectionApprovalType Class
 A type element that represents a connection approval type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class StructuralConnectionApprovalType : ElementType
Visual Basic
Public Class StructuralConnectionApprovalType _
	Inherits ElementType
Visual C++
public ref class StructuralConnectionApprovalType : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
See Also
StructuralConnectionApprovalType Members
Autodesk.Revit.DB.Structure Namespace